// Візьміть файл template1.html, підключіть до нього скрипт, і працюйте в ньому!

// - Напишіть код,  котрий :
// -- отримує текст з параграфа з id "content"
// -- отримує текст з блоку з id "rules"
// -- замініть текст параграфа з id 'content' на будь-який інший
// -- замініть текст параграфа з id 'rules' на будь-який інший
// -- змініть кожному елементу колір фону на червоний
// -- змініть кожному елементу колір тексту на синій
// -- отримати весь список класів елемента з id=rules і вивести їх в console.log
// -- поміняти колір тексту у всіх елементів fc_rules на червоний

/* <----------------------------------------------------------------------------------------------------------------> */
// let txtId = document.getElementById('content')
// console.log(txtId)
/* <----------------------------------------------------------------------------------------------------------------> */
// let txtRules = document.getElementById('rules')
// console.log(txtRules)
/* <----------------------------------------------------------------------------------------------------------------> */
// txtId.innerHTML = '<i>Hello okten</i>'
// txtRules.innerHTML = '<b>Hello world</b>'
/* <----------------------------------------------------------------------------------------------------------------> */
// for (let item of document.body.children) {
//     item.style.backgroundColor = 'red'
// }
/* <----------------------------------------------------------------------------------------------------------------> */
// for (let item of document.body.children) {
//     item.style.color = 'blue'
// }
/* <----------------------------------------------------------------------------------------------------------------> */
// let allClasses = document.getElementById('rules')
// console.log(allClasses.classList)
/* <----------------------------------------------------------------------------------------------------------------> */
// for (let item of document.getElementsByClassName('fc_rules')) {
//     item.style.color = 'red'
// }
/* <----------------------------------------------------------------------------------------------------------------> */
